In [4]:
#pip install pyreadr

In [1]:
import pandas as pd
import pyreadr
import numpy as np
from functools import reduce
import warnings
warnings.filterwarnings("ignore")

# Data Cleaning

## 0. Files for helping unify the USstate presentation

In [2]:
delineation_df = pd.read_excel('./data/delineation_file.xls')
delineation_df = delineation_df.iloc[1:1918]
delineation_df = delineation_df.rename(columns=delineation_df.iloc[0])
delineation_df = delineation_df.drop(1)
delineation_df['FIPS State Code'] = delineation_df['FIPS State Code'].astype(int)
delineation_df['CBSA Code'] = delineation_df['CBSA Code'].astype(int)
delineation_df = delineation_df[['CBSA Code', 'State Name', 'FIPS State Code', 'FIPS County Code']]

abbr_name = pd.read_csv('./data/abbr-name.csv')
abbr_name['abbr'] = abbr_name['abbr'].str.lower()

code_merged = pd.merge(delineation_df, abbr_name, left_on='State Name', right_on='full', how='left')
code_merged = code_merged.drop(columns=['full'])
code_merged.drop_duplicates()

      CBSA Code    State Name  FIPS State Code FIPS County Code abbr
0         10100  South Dakota               46              013   sd
1         10100  South Dakota               46              045   sd
2         10140    Washington               53              027   wa
3         10180         Texas               48              059   tx
4         10180         Texas               48              253   tx
...         ...           ...              ...              ...  ...
1911      49700    California                6              101   ca
1912      49700    California                6              115   ca
1913      49740       Arizona                4              027   az
1914      49780          Ohio               39              119   oh
1915      49820         Texas               48              505   tx

[1916 rows x 5 columns]

In [7]:
state = abbr_name['abbr'].to_list()

## 1. Crime Data 2011-2020

In [4]:
crime_2011 = pd.read_csv('./data/crime/crime_2011.csv')
crime_2012 = pd.read_csv('./data/crime/crime_2012.csv')
crime_2013 = pd.read_csv('./data/crime/crime_2013.csv')
crime_2014 = pd.read_csv('./data/crime/crime_2014.csv')
crime_2015 = pd.read_csv('./data/crime/crime_2015.csv')
crime_2016 = pd.read_csv('./data/crime/crime_2016.csv')
crime_2017 = pd.read_csv('./data/crime/crime_2017.csv')
crime_2018 = pd.read_csv('./data/crime/crime_2018.csv')
crime_2019 = pd.read_csv('./data/crime/crime_2019.csv')
crime_2020 = pd.read_csv('./data/crime/crime_2020.csv')

In [5]:
crime_11_20 = pd.concat([crime_2011, crime_2012, crime_2013, crime_2014, crime_2015, crime_2016, crime_2017, 
                         crime_2018, crime_2019, crime_2020])
crime_11_20 = crime_11_20.drop("Unnamed: 0",axis=1)
max_pop = crime_11_20['state_abb'][crime_11_20['population'].idxmax()]
print(max_pop)
min_pop = crime_11_20['state_abb'][crime_11_20['population'].idxmin()]
print(min_pop)

165120    NY
165120    NY
165120    NY
165120    NY
165120    NY
165120    NY
165120    NY
165120    NJ
165120    NJ
165120    NJ
Name: state_abb, dtype: object
264    AK
264    AK
264    AK
264    AK
264    AK
264    AK
264    AK
264    AK
264    AK
264    AK
Name: state_abb, dtype: object

In [6]:
crime_11_20 = crime_11_20.groupby(['state_abb','year','month']).sum().reset_index()
crime_11_20['state_abb'] = crime_11_20['state_abb'].str.lower()
months = {'january': 1, 'february': 2, 'march': 3, 'april':4, 'may':5, 'june':6, 'july':7, 'august':8, 
          'september':9, 'october':10, 'november':11, 'december':12}
for index, row in crime_11_20.iterrows():
    crime_11_20['month'][index] = months[row['month']]
crime_11_20 = crime_11_20.rename(columns={'state_abb': 'USstate'})
crime_11_20.to_csv('./data/crime/crime.csv')
crime_11_20

     USstate  year month  population  actual_rape_total
0         ak  2011     4      725910                 26
1         ak  2011     8      725910                 45
2         ak  2011    12      725910                 32
3         ak  2011     2      725910                 29
4         ak  2011     1      725910                 36
...      ...   ...   ...         ...                ...
6475      wy  2020     3      593429                 29
6476      wy  2020     5      593429                 18
6477      wy  2020    11      593429                 23
6478      wy  2020    10      593429                 40
6479      wy  2020     9      593429                 37

[6480 rows x 5 columns]

## 2. Alcohol Data for 2012-2020

In [8]:
alcohol_12 = pd.read_csv('./data/alcohol/CBP2012.csv')
alcohol_13 = pd.read_csv('./data/alcohol/CBP2013.csv')
alcohol_14 = pd.read_csv('./data/alcohol/CBP2014.csv')
alcohol_15 = pd.read_csv('./data/alcohol/CBP2015.csv')
alcohol_16 = pd.read_csv('./data/alcohol/CBP2016.csv')
alcohol_17 = pd.read_csv('./data/alcohol/CBP2017.csv')
alcohol_18 = pd.read_csv('./data/alcohol/CBP2018.csv')
alcohol_19 = pd.read_csv('./data/alcohol/CBP2019.csv')
alcohol_20 = pd.read_csv('./data/alcohol/CBP2020.csv')
alcohol_12_20 = pd.concat([alcohol_12, alcohol_13, alcohol_14, alcohol_15, alcohol_16, 
                           alcohol_17, alcohol_18, alcohol_19, alcohol_20])
alcohol_12_20 = pd.merge(alcohol_12_20, abbr_name, left_on='Geographic Area Name (NAME)', right_on='full', how='left')
alcohol_12_20 = alcohol_12_20.dropna(subset=['full'])
alcohol_12_20 = alcohol_12_20.drop(columns=['full', 'Geographic Area Name (NAME)'])
alcohol_12_20 = alcohol_12_20.rename(columns={'Year (YEAR)': 'year','abbr': 'USstate'})
alcohol_df = alcohol_12_20.groupby(['year','USstate']).sum().reset_index()
alcohol_state = set(alcohol_df['USstate'].to_list())
year = [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020]
month = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
full_alcohol = pd.DataFrame(columns=['USstate', 'year', 'month', 'factor'])
for i in range(len(alcohol_state)):
    for j in year:
        for k in month:
            
            if k == 12:
                full_alcohol = full_alcohol.append({'USstate': state[i], 'year': j, 'month': k, 'factor': 1}, 
                                                   ignore_index=True)
            else:
                full_alcohol = full_alcohol.append({'USstate': state[i], 'year': j, 'month': k, 'factor': 0}, 
                                                   ignore_index=True)
print(len(alcohol_state))

alcohol_df = pd.merge(alcohol_df, full_alcohol, on=['USstate', 'year'], how='right')
alcohol_df['Number of establishments (ESTAB)'] = alcohol_df['Number of establishments (ESTAB)'] * alcohol_df['factor']
alcohol_df = alcohol_df.drop(columns=['factor'])
alcohol_df['Number of establishments (ESTAB)'] = alcohol_df['Number of establishments (ESTAB)'].replace({0:np.nan})
alcohol_df

50

        year USstate  Number of establishments (ESTAB) month
0     2012.0      al                               NaN     1
1     2012.0      al                               NaN     2
2     2012.0      al                               NaN     3
3     2012.0      al                               NaN     4
4     2012.0      al                               NaN     5
...      ...     ...                               ...   ...
5395  2020.0      wi                               NaN     8
5396  2020.0      wi                               NaN     9
5397  2020.0      wi                               NaN    10
5398  2020.0      wi                               NaN    11
5399  2020.0      wi                             401.0    12

[5400 rows x 4 columns]

In [9]:
alcohol = pd.DataFrame()
for i in range(len(alcohol_state)):
    curr_alcohol = alcohol_df[alcohol_df['USstate']==state[i]]
    curr_alcohol['Number of establishments (ESTAB)'] = curr_alcohol['Number of establishments (ESTAB)'].interpolate(method ='cubic', limit_direction ='forward')
    curr_alcohol['Number of establishments (ESTAB)'] = curr_alcohol['Number of establishments (ESTAB)'].interpolate(method ='linear', limit_direction ='backward')
    alcohol = pd.concat([alcohol, curr_alcohol])

alcohol['year'] = pd.to_numeric(alcohol['year'])
alcohol['month'] = pd.to_numeric(alcohol['month'])
alcohol.to_csv('./data/alcohol/alcohol.csv')
alcohol

        year USstate  Number of establishments (ESTAB)  month
0     2012.0      al                        367.000000      1
1     2012.0      al                        367.000000      2
2     2012.0      al                        367.000000      3
3     2012.0      al                        367.000000      4
4     2012.0      al                        367.000000      5
...      ...     ...                               ...    ...
5395  2020.0      wi                        395.007043      8
5396  2020.0      wi                        395.689052      9
5397  2020.0      wi                        396.886787     10
5398  2020.0      wi                        398.642888     11
5399  2020.0      wi                        401.000000     12

[5400 rows x 4 columns]

## 3. Twitter Data 2012-2021

In [14]:
# use proportion of misogyny tweets
all_tweets = pd.read_excel('./data/tweet/All_Tweets_State_Month_Year_05082022.xlsx')
misogyny_tweets = pd.read_excel('./data/tweet/Misogyny_Tweets_State_Month_Year_05082022.xlsx')
tweets = pd.merge(all_tweets, misogyny_tweets, on = ['USstate', 'year', 'month.keyword: Descending'])
tweets = tweets.sort_values(by=['year', 'month.keyword: Descending'], ascending=True)
tweets = tweets.rename(columns={'month.keyword: Descending': 'month'})

tweets_state = set(tweets['USstate'].to_list())

In [12]:
year = [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021]
month = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
full_tweet = pd.DataFrame(columns=['USstate', 'year', 'month'])
for i in range(len(tweets_state)):
    for j in year:
        for k in month:
            full_tweet = full_tweet.append({'USstate': state[i], 'year': j, 'month': k}, ignore_index=True)
print(len(tweets_state))

47

In [15]:
tweets = pd.merge(tweets, full_tweet, on=['USstate', 'year', 'month'], how='right')
tweets

     USstate    year month  nTweets_x  nTweets_y
0         al    2012     1        NaN        NaN
1         al  2012.0   2.0    51744.0        3.0
2         al  2012.0   3.0    55089.0        2.0
3         al  2012.0   4.0    38471.0        1.0
4         al  2012.0   5.0    36891.0        1.0
...      ...     ...   ...        ...        ...
5635      va  2021.0   8.0    31318.0        1.0
5636      va    2021     9        NaN        NaN
5637      va    2021    10        NaN        NaN
5638      va    2021    11        NaN        NaN
5639      va  2021.0  12.0    31921.0        1.0

[5640 rows x 5 columns]

In [16]:
# use spline to fill the missing data # cubic
tweets = pd.merge(tweets, full_tweet, on=['USstate', 'year', 'month'], how='right')
tweets['nTweets_x'] = tweets['nTweets_x'].interpolate(method ='linear', limit_direction ='backward')
tweets['nTweets_y'] = tweets['nTweets_y'].interpolate(method ='linear', limit_direction ='backward')
tweets['year'] = pd.to_numeric(tweets['year'])
tweets['month'] = pd.to_numeric(tweets['month'])
tweets.to_csv('./data/tweet/tweets_df.csv')
tweets

     USstate  year  month  nTweets_x  nTweets_y
0         al  2012      1   51744.00        3.0
1         al  2012      2   51744.00        3.0
2         al  2012      3   55089.00        2.0
3         al  2012      4   38471.00        1.0
4         al  2012      5   36891.00        1.0
...      ...   ...    ...        ...        ...
5635      va  2021      8   31318.00        1.0
5636      va  2021      9   31468.75        1.0
5637      va  2021     10   31619.50        1.0
5638      va  2021     11   31770.25        1.0
5639      va  2021     12   31921.00        1.0

[5640 rows x 5 columns]

# 4. Cost of living data 2012-2021

In [19]:
cost_of_living_12 = pd.read_csv('./data/cost of living/Cost_living_2012.csv')
cost_of_living_13 = pd.read_csv('./data/cost of living/Cost_living_2013.csv')
cost_of_living_14 = pd.read_csv('./data/cost of living/Cost_living_2014.csv')
cost_of_living_15 = pd.read_csv('./data/cost of living/Cost_living_2015.csv')
cost_of_living_16 = pd.read_csv('./data/cost of living/Cost_living_2016.csv')
cost_of_living_17 = pd.read_csv('./data/cost of living/Cost_living_2017.csv')
cost_of_living_18 = pd.read_csv('./data/cost of living/Cost_living_2018.csv')
cost_of_living_19 = pd.read_csv('./data/cost of living/Cost_living_2019.csv')
cost_of_living_20 = pd.read_csv('./data/cost of living/Cost_living_2020.csv')
cost_of_living_21 = pd.read_csv('./data/cost of living/Cost_living_2021.csv')

cost_living_12_21 = pd.concat([cost_of_living_12, cost_of_living_13, cost_of_living_14, cost_of_living_15, cost_of_living_16, 
                                cost_of_living_17, cost_of_living_18,cost_of_living_19, cost_of_living_20, cost_of_living_21])
cost_living_12_21['USstate'] = cost_living_12_21['USstate'].str.lower()
cost_living_12_21 = cost_living_12_21.drop("Unnamed: 0",axis=1)
cost_living_12_21

    Year USstate  Cost of Living Index
0   2012      ma                106.80
1   2012      hi                103.46
2   2012      ca                102.52
3   2012      wa                101.04
4   2012      ny                100.00
..   ...     ...                   ...
34  2021      ok                 64.61
35  2021      ut                 63.89
36  2021      id                 63.30
37  2021      ar                 62.89
38  2021      ks                 61.09

[348 rows x 3 columns]

In [20]:
cost_living_12_21.rename(columns={'Year': 'year'}, inplace=True)
cost_living_12_21 = cost_living_12_21.groupby(['year','USstate']).sum().reset_index()
cost_of_living_state = set(cost_living_12_21['USstate'].to_list())



year = [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020,2021]
month = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
col_all = pd.DataFrame(columns=['USstate', 'year', 'month', 'factor'])
for i in range(len(cost_of_living_state)):
    for j in year:
        for k in month:
            if k == 12:
                col_all = col_all.append({'USstate': state[i], 'year': j, 'month': k, 'factor': 1}, 
                                                   ignore_index=True)
            else:
                col_all = col_all.append({'USstate': state[i], 'year': j, 'month': k, 'factor': 0}, 
                                                   ignore_index=True)

In [26]:
cost_living_data = pd.merge(cost_living_12_21, col_all, on=['USstate', 'year'], how='right')

In [27]:
cost_living_data['Cost of Living Index'] = cost_living_data['Cost of Living Index'] * cost_living_data['factor']
cost_living_data = cost_living_data.drop(columns=['factor'])
cost_living_data['Cost of Living Index'] = cost_living_data['Cost of Living Index'].replace({0:np.nan})
cost_living_data['Cost of Living Index'] = cost_living_data['Cost of Living Index'].interpolate(method ='cubic', limit_direction ='backward')
cost_living_data['Cost of Living Index'] = cost_living_data['Cost of Living Index'].interpolate(method ='linear', limit_direction ='backward')
cost_living_data['year'] = pd.to_numeric(cost_living_data['year'])
cost_living_data['month'] = pd.to_numeric(cost_living_data['month'])
cost_living_data = cost_living_data.rename(columns={'Cost of Living Index':'cost_of_living_index'})
cost_living_data.to_csv('./data/cost of living/cost_living_data.csv')
cost_living_data

      year USstate  cost_of_living_index  month
0     2012      al             71.180000      1
1     2012      al             71.180000      2
2     2012      al             71.180000      3
3     2012      al             71.180000      4
4     2012      al             71.180000      5
...    ...     ...                   ...    ...
5275  2021      tx             68.324387      8
5276  2021      tx             68.391636      9
5277  2021      tx             68.459544     10
5278  2021      tx             68.526276     11
5279  2021      tx             68.590000     12

[5280 rows x 4 columns]

# 5. Merge all datasets

In [40]:
# alcohol and twitter
al_twitter = pd.merge(tweets, alcohol, right_on=['USstate','year','month'], left_on=['USstate', 'year','month'])
al_twitter = pd.merge(al_twitter, abbr_name, left_on='USstate', right_on='abbr', how='left')
al_twitter = al_twitter.dropna()
al_twitter
# add crime
merged_df = pd.merge(al_twitter, crime_11_20, left_on=['USstate', 'year', 'month'], right_on=['USstate', 'year', 'month'], how='left')
merged_df['actual_rape_total'] = merged_df['actual_rape_total'].interpolate(method ='cubic', limit_direction ='backward')
merged_df
# add cost of living data
merged_df = pd.merge(merged_df, cost_living_data, left_on=['USstate', 'year', 'month'], right_on=['USstate', 'year', 'month'], how='left')
merged_df = merged_df.dropna()
merged_df

,USstate,year,month,nTweets_x,nTweets_y,Number of establishments (ESTAB),abbr,full,population,actual_rape_total,cost_of_living_index
0,al,2012,1,51744.0,3.0,367.000000,al,Alabama,4834334,106,71.180000
1,al,2012,2,51744.0,3.0,367.000000,al,Alabama,4834334,70,71.180000
2,al,2012,3,55089.0,2.0,367.000000,al,Alabama,4834334,78,71.180000
3,al,2012,4,38471.0,1.0,367.000000,al,Alabama,4834334,86,71.180000
4,al,2012,5,36891.0,1.0,367.000000,al,Alabama,4834334,101,71.180000
...,...,...,...,...,...,...,...,...,...,...,...
4639,tx,2020,8,711151.0,6.0,2020.148940,tx,Texas,29436098,1215,68.235824
4640,tx,2020,9,669447.0,3.0,2023.291326,tx,Texas,29436098,1220,68.152224
4641,tx,2020,10,708416.0,5.0,2026.644063,tx,Texas,29436098,1158,68.091275
4642,tx,2020,11,709005.0,3.0,2030.212003,tx,Texas,29436098,1021,68.051145
4643,tx,2020,12,662061.0,3.0,2034.000000,tx,Texas,29436098,912,68.030000

In [170]:
merged_df.to_csv('./data/merged_data.csv')